Documents/ВыдачаБланков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ВыдачаБланков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетДополнительныхЛистов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидБланка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСетификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эксперт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЛисты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоБланков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыБланков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>СтатусыБланков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Использован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Испорчен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВыдачаБланков/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	если   значениезаполнено(ВидБланка) и  значениезаполнено(Эксперт) 
		и не (ДополнительныеЛисты=0 и (НачальныйНомер=0 или КонечныйНомер=0) )  тогда
	
	
	Если ДополнительныеЛисты   >0 Тогда 
		Движения.УчетДополнительныхЛистов.Записывать = Истина;
		Движение = Движения.УчетДополнительныхЛистов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Эксперт = Эксперт;
		Движение.Организация = Организация;
		Движение.ДопЛистов = ДополнительныеЛисты;
		Движение.ВидСертификата=ВидБланка;
	КонецЕсли;
	
	
	Если НачальныйНомер  >    0 и КонечныйНомер>=НачальныйНомер тогда
		мен=РегистрыСведений.НомераБланков.СоздатьМенеджерЗаписи();
		для  ии = НачальныйНомер по КонечныйНомер цикл
			мен.Номер=ии;
			мен.Прочитать();
			
			Если  мен.Выбран() тогда
				мен.Удалить();
			КонецЕсли ;	  
			
			Если не мен.Выбран() тогда
				мен.номер=ии   ;
				мен.ВидСертификата=ВидБланка;
				//мен.ДатаВыдачи=ТекущаяДата();
				мен.ДатаВыдачи=Дата;
				мен.Организация=Организация;
				мен.Эксперт=Эксперт;
				мен.СтатусБланка=Перечисления.СтатусыБланков.Выдан;
				мен.Записать();
			КонецЕсли 
			
		КонецЦикла;
		
	КонецЕсли
	
	иначе
	
	сообщить("Не заполнены необх. данные");
	Отказ=истина;
	КонецЕсли
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения = Неопределено Тогда // Ввод нового.
		ЭкспертизаИСертификация.ПриВводеНовогоЗаполнитьОрганизацию(ЭтотОбъект);
		//Эксперт = Пользователи.ТекущийПользователь();
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры
